Repository: wladuardo/EazyLocalize
Catalog: EasyLocalize/Constants/*.lproj/Localizable.strings
Languages: de, fr, hi, ja, pt_br, ru, sv, vi, zh_hans

source: Add translation
de: Übersetzung hinzufügen
fr: Ajouter une traduction
hi: अनुवाद जोड़ें
ja: 翻訳を追加する
pt_br: Adicionar tradução
ru: Добавить перевод
sv: Lägg till översättning
vi: Thêm bản dịch
zh_hans: 添加翻译

# choosePath
source: Choose the path to your Xcode project
de: Wählen Sie den Pfad zu Ihrem Xcode-Projekt
fr: Choisissez le chemin vers votre projet Xcode
hi: अपने Xcode प्रोजेक्ट का पथ चुनें
ja: Xcodeプロジェクトへのパスを選択してください
pt_br: Escolha o caminho para o seu projeto Xcode
ru: Выберите путь к вашему Xcode-проекту
sv: Välj sökvägen till ditt Xcode-projekt
vi: Chọn đường dẫn đến dự án Xcode của bạn
zh_hans: 选择您的Xcode项目的路径

source: choose
de: wählen
fr: choisir
hi: चुनें
ja: 選ぶ
pt_br: escolher
ru: выбрать
sv: välja
vi: chọn
zh_hans: 选择

# enterYourKey
source: Enter the key here (without quotes)
de: Geben Sie den Schlüssel hier ein (ohne Anführungszeichen)
fr: Entrez la clé ici (sans guillemets)
hi: यहां कुंजी दर्ज करें (बिना कवोटेशन के)
ja: ここにキーを入力してください（引用符なし）
pt_br: Digite a chave aqui (sem aspas)
ru: Введите ключ здесь (без кавычек)
sv: Ange nyckeln här (utan citationstecken)
vi: Nhập khóa ở đây (không có dấu ngoặc)
zh_hans: 在此输入密钥（不用引号）

# enterTextToTranslate
source: Enter the phrase to be translated
de: Geben Sie den Satz ein, der übersetzt werden soll
fr: Entrez la phrase à traduire
hi: अनुवाद करने के लिए शब्द दर्ज करें
ja: 翻訳したいフレーズを入力してください
pt_br: Digite a frase a ser traduzida
ru: Введите фразу, которую нужно перевести
sv: Ange frasen som ska översättas
vi: Nhập cụm từ cần dịch
zh_hans: 输入要翻译的短语

source: Choose another path
de: Wähle einen anderen Weg
fr: Choisissez un autre chemin
hi: एक दूसरा मार्ग चुनें
ja: 別の道を選ぶ
pt_br: Escolha outro caminho
ru: Выберите другой путь
sv: Välj en annan väg
vi: Chọn một con đường khác
zh_hans: 选择另一条路

# getTranslateFromChat
source: Request translation in ChatGPT
de: Übersetzung in ChatGPT anfordern
fr: Demander une traduction dans ChatGPT
hi: ChatGPT में अनुवाद का अनुरोध करें
ja: ChatGPTで翻訳をリクエストする
pt_br: Solicitar tradução no ChatGPT
ru: Запросить перевод в ChatGPT
sv: Begära översättning i ChatGPT
vi: Yêu cầu dịch trong ChatGPT
zh_hans: 在ChatGPT请求翻译

# enterNameForKey
source: Enter a name for the key
de: Geben Sie einen Namen für den Schlüssel ein
fr: Entrez un nom pour la clé
hi: कुंजी के लिए एक नाम दर्ज करें
ja: キーの名前を入力してください
ru: Введите название для ключа
sv: Ange ett namn för nyckeln
vi: Nhập tên cho khóa
zh_hans: 输入键的名称

# localizableFound
source: The following Localizable.strings files were found in your project:
de: Folgende Localizable.strings-Dateien wurden in Ihrem Projekt gefunden:
fr: Les fichiers Localizable.strings suivants ont été trouvés dans votre projet:
hi: आपके परियोजना में निम्नलिखित Localizable.strings फ़ाइलें मिलीं:
ja: プロジェクトで次の Localizable.strings ファイルが見つかりました:
pt_br: Os seguintes arquivos Localizable.strings foram encontrados no seu projeto:
ru: Обнаружены следующие файлы Localizable.strings в вашем проекте:
sv: Följande Localizable.strings-filer hittades i ditt projekt:
vi: Các tệp Localizable.strings sau đã được tìm thấy trong dự án của bạn:
zh_hans: 在您的项目中找到了以下 Localizable.strings 文件:

source: Clear
de: Löschen
fr: Effacer
hi: साफ करें
ja: クリア
pt_br: Limpar
ru: Очистить
sv: Rensa
vi: Xoá
zh_hans: 清除

source: translate
de: Übersetzen
fr: traduire
hi: अनुवाद करें
ja: 翻訳する
pt_br: traduzir
ru: перевести
sv: översätta
vi: dịch
zh_hans: 翻译

source: Success
de: Erfolg
fr: Succès
hi: सफलता
ja: 成功
pt_br: Sucesso
ru: Успех
sv: Framgång
vi: Thành công
zh_hans: 成功

# translatesAdded
source: Translations successfully added
de: Übersetzungen erfolgreich hinzugefügt
fr: Traductions ajoutées avec succès
hi: अनुवाद सफलतापूर्वक जोड़े गए हैं
ja: 翻訳が成功補完されました
pt_br: Traduções adicionadas com sucesso
ru: Переводы успешно добавлены
sv: Översättningar har lagts till framgångsrikt
vi: Dịch thành công đã được thêm
zh_hans: 翻译成功添加

# noAccess
source: No permission to write file
de: Keine Berechtigung zum Schreiben der Datei
fr: Pas de permission d'écriture du fichier
hi: फ़ाइल लिखने की अनुमति नहीं है
ja: ファイルの書き込み許可がありません
pt_br: Sem permissão para escrever o arquivo
ru: Нет разрешения на запись файла
sv: Inget tillstånd att skriva filen
vi: Không có quyền ghi vào tệp
zh_hans: 没有文件写入权限

# updateError
source: File update error
de: Aktualisierungsfehler der Datei
fr: Erreur de mise à jour du fichier
hi: फ़ाइल अपडेट त्रुटि
ja: ファイルの更新エラー
pt_br: Erro de atualização do arquivo
ru: Ошибка обновления файла
sv: Filuppdateringsfel
vi: Lỗi cập nhật tệp
zh_hans: 文件更新错误

# translateError
source: Error retrieving translation
de: Fehler beim Abrufen der Übersetzung
fr: Erreur lors de la récupération de la traduction
hi: अनुवाद प्राप्ति में त्रुटि
ja: 翻訳の取得中にエラーが発生しました
pt_br: Erro ao obter a tradução
ru: Ошибка при получении перевода
sv: Fel vid hämtning av översättning
vi: Lỗi khi nhận bản dịch
zh_hans: 获取翻译时出错

# emptyTextToTranslate
source: Nothing to translate
de: Nichts zu übersetzen
fr: Rien à traduire
hi: अनुवाद करने के लिए कुछ नहीं
ja: 翻訳するものはありません
pt_br: Nada para traduzir
ru: Нечего переводить
sv: Inget att översätta
vi: Không có gì để dịch
zh_hans: 没什么可翻译的

# emptyTextToTranslateDesc
source: You did not enter the text to translate
de: Sie haben den zu übersetzenden Text nicht eingegeben
fr: Vous n'avez pas saisi le texte à traduire
hi: आपने उस पाठ को दर्ज नहीं किया है जो अनुवाद करना है
ja: 翻訳するテキストを入力していません
pt_br: Você não inseriu o texto a ser traduzido
ru: Вы не ввели текст, который нужно перевести
sv: Du har inte angett den text som ska översättas
vi: Bạn chưa nhập văn bản cần dịch
zh_hans: 您没有输入需要翻译的文本

# noAccessDesc
source: You do not have permission to write the file "Localizable.strings"
de: Sie haben keine Berechtigung, die Datei "Localizable.strings" zu schreiben
fr: Vous n'avez pas la permission d'écrire le fichier "Localizable.strings"
hi: आपको फ़ाइल "Localizable.strings" लिखने की अनुमति नहीं है
ja: "Localizable.strings" ファイルを書き込む権限がありません
pt_br: Você não tem permissão para escrever o arquivo "Localizable.strings"
ru: У вас нет разрешения на запись файла "Localizable.strings"
sv: Du har inte behörighet att skriva filen "Localizable.strings"
vi: Bạn không có quyền ghi tệp "Localizable.strings"
zh_hans: 您没有写入 "Localizable.strings" 文件的权限
